// 1) Напишите программу, где пользователь вводит любое целое положительное число. 
// А программа суммирует все числа от 1 до введенного пользователем числа.

// let sum = +prompt("Введите положительное число");
// let group = 0;
// if (sum >=0) {
//     for (let i = 1; i <= sum; i++) {
//         group += i
//     }
//     console.log(group);
// }   else if(sum < 0) {
//     console.log("Введите положительное число");
// }   else {
//     console.log("Введите число");
// }

// 2) Треугольник в цикле

// Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// 2.Напишите цикл, который за 7 вызовов console.log выводит такой треугольник://
// let str="#";
// while (str.length<=7){
//     console.log(str+"\n")
//     str=str+"#"
//}
//
// 3.Напишите программу, которая выводит через console.log все числа от 1 до 100, с двумя исключениями. Для чисел, нацело делящихся на 3, она должна выводить
// ‘Fizz’, а для чисел, делящихся на 5 (но не на 3) – ‘Buzz’.//
//Когда сумеете – исправьте её так, чтобы она выводила «FizzBuzz» для всех чисел, которые делятся и на 3, и на 5.//

